# FamilyTypeSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyTypeSet Class
Members See Also
---
A set that contains FamilyType objects.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class FamilyTypeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class FamilyTypeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class FamilyTypeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FamilyTypeSet
# See Also
FamilyTypeSet Members
Autodesk.Revit.DB Namespace